In [1]:
import pandas as pd
import numpy as np

In [2]:
rating_data = pd.read_csv("rating.csv")
cuisine_data = pd.read_csv("cuisine.csv")

In [26]:
rating_data.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [27]:
cuisine_data.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

# Recommendation based on simple counting

We can find the most popular restaurant using the rating provided 
1. For each unique placeID , we want to collect the ratings
2. create a dataframe with placeID and rating using pd.DataFrame()
3. sort this by descending order of rating column by calling sort_values()  method

In [24]:
rating_total_count=pd.DataFrame(rating_data.groupby('placeID')['rating'].count())
rating_total_count.sort_values("rating", ascending=False).head(5)
## This gives the top 5 most reviewed places with highest number of ratings of  36

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25

# We identify if the top 5 places with maximum ratings has any similarity with cuisine tht they serve

In [39]:
most_rated_places= pd.DataFrame([135085,132825,135032,135052,132834], index=np.arange(5),columns=['placeID'])
summary = pd.merge(most_rated_places, cuisine_data, on='placeID')
summary

   placeID         Rcuisine
0   135085        Fast_Food
1   132825          Mexican
2   135032        Cafeteria
3   135032     Contemporary
4   135052              Bar
5   135052  Bar_Pub_Brewery
6   132834          Mexican

In [40]:
cuisine_data['Rcuisine'].describe()

count         916
unique         59
top       Mexican
freq          239
Name: Rcuisine, dtype: object

# Most frequently occuring cuisine is "Mexican"
# Two of the top 5 places serve Mexican food 
# Recommender is suggesting that the most popular cuisine is "Mexican" and the places that serve it are good candidates for recommending